OpenFOAM-master/of-xp/OpenFOAM-2.3.1/tutorials/multiphase/interDyMFoam/ras/sloshingTank2D3DoF/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

m4 constant/polyMesh/blockMeshDict.m4 > constant/polyMesh/blockMeshDict
runApplication blockMesh
cp 0/alpha.water.org 0/alpha.water
runApplication setFields
runApplication `getApplication`

# ----------------------------------------------------------------- end-of-file
